[
    {
        "img": "posters/bonaldi_poster.pdf",
        "title": "A Dialogue Dataset for Hate Speech Countering",
        "authors": "Helena Bonaldi, Sara Dellantonio, Serra Sinem Tekiroǧlu, Marco Guerini",
        "category": "Resource",
        "description": "Counter narratives have emerged as an effective tool employed by NGOs to respond to online hate on social media platforms, leading to the exploration of Natural Language Generation for automated counter narrative writing. However, existing counter narrative datasets are limited to 2-turn interactions, while in real life, interactions can consist of multiple turns. In this paper, we present a dialogical data collection approach, which combines the intervention of human expert annotators over machine-generated dialogues. The result is DIALOCONAN, the first dataset with over 3000 fictitious dialogues between a hater and an NGO operator, covering 6 targets of hate."
    },
    {
        "img": "posters/EACL 2023 - POSTER - An In-depth Analysis of Implicit and Subtle Hate Speech Messages.pdf",
        "title": "An In-depth Analysis of Implicit and Subtle Hate Speech Messages.",
        "authors": "Nicolas Benjamin Ocampo, Ekaterina Sviridova, Elena Cabrio, and Serena Villata",
        "category": "Application",
        "description": "The research carried out so far in detecting abusive content in social media has primarily focused on overt forms of hate speech. While explicit hate speech (HS) is more easily identifiable by recognizing hateful words, messages containing linguistically subtle and implicit forms of HS (as circumlocution, metaphors and sarcasm) constitute a real challenge for automatic systems. While the sneaky and tricky nature of subtle messages might be perceived as less hurtful with respect to the same content expressed clearly, such abuse is at least as harmful as overt abuse. In this paper, we first provide an in-depth and systematic analysis of 7 standard benchmarks for HS detection, relying on a fine-grained and linguistically-grounded definition of implicit and subtle messages. Then, we experiment with state-of-the-art neural network architectures on two supervised tasks, namely implicit HS and subtle HS message classification. We show that while such models perform satisfactory on explicit messages, they fail to detect implicit and subtle content, highlighting the fact that HS detection is not a solved problem and deserves further investigation."
    },
    {
        "img": "posters/goffredo.pdf",
        "title": "Argument-based Detection and Classification of Fallacies in Political Debates",
        "authors": "Pierpaolo Goffredo, Mariana Chaves Espinoza, Elena Cabrio, Serena Villata",
        "category": "Application",
        "description": "Fallacies are arguments that employ faulty reasoning. Given their persuasive and seemingly valid nature, fallacious arguments are often used in political debates. Employing these misleading arguments in politics can have detrimental consequences for society, since they can lead to inaccurate conclusions and invalid inferences from the public opinion and the policymakers. Automatically detecting and classifying fallacious arguments represents therefore a crucial challenge to limit the spread of misleading or manipulative claims and promote a more informed and healthier political discourse. Our contribution to address this challenging task is twofold. First, we extend the ElecDeb60To16 dataset of U.S. presidential debates annotated with fallacious arguments, by incorporating the most recent Trump-Biden presidential debate. We include updated token-level annotations, incorporating argumentative components (i.e., claims and premises), the relations between these components (i.e., support and attack), and six categories of fallacious arguments (i.e., Ad Hominem, Appeal to Authority, Appeal to Emotion, False Cause, Slippery Slope, and Slogans). Second, we perform the twofold task of fallacious argument detection and classification by defining neural network architectures based on Transformers models, combining text, argumentative features, and engineered features. Our results show the advantages of complementing transformer-generated text representations with non-textual features."},
    {
        "img": "posters/grammar_net_poster.pdf",
        "title": "Constituency Tree Representation for Argument Unit Recognition",
        "authors": "Samuel Guilluy, Florian Méhats and Billal Chouli",
        "category": "Algorithm",
        "description": "The extraction of arguments from sentences is usually studied by considering only the neighbourhood dependencies of words. Such a representation does not rely on the syntactic structure of the sentence and can lead to poor results especially in languages where grammatical categories are scattered in the sentence. In this paper, we investigate the advantages of using a constituency tree representation of sentences for argument discourse unit (ADU) prediction. We demonstrate that the constituency structure is more powerful than simple linear dependencies between neighbouring words in the sentence. Our work was organised as follows: First, we compare the maximum depth allowed for our constituency trees. This first step allows us to choose an optimal maximum depth. Secondly, we combine this structure with graph neural networks, which are very successful in neural network tasks. Finally, we evaluate the benefits of adding a conditional random field to model global dependencies between labels, given local dependency rules. We improve the current best models for argument unit recognition at token level and also present an explainability method to evaluate the suitability of our model architecture."
    },
    {
        "img": "posters/molinet.pdf",
        "title": "ACTA 2.0: A Modular Architecture for Multi-Layer Argumentative Analysis of Clinical Trials",
        "authors": "Benjamin Molinet, Santiago Marro, Elena Cabrio, Serena Villata, Tobias Mayer, Cristian Cardellino, Theo Alkibiades Collias",
        "category": "Application",
        "description": "Evidence-based medicine aims at making decisions about the care of individual patients based on the explicit use of the best available evidence in the patient clinical history and the medical literature results. Argumentation represents a natural way of addressing this task by (i) identifying evidence and claims in text, and (ii) reasoning upon the extracted arguments and their relations to make a decision. ACTA 2.0 is an automated tool which relies on Argument Mining methods to analyse the abstracts of clinical trials to extract argument components and relations to support evidence-based clinical decision making. ACTA 2.0 allows also for the identification of PICO (Patient, Intervention, Comparison, Outcome) elements, and the analysis of the effects of an intervention on the outcomes of the study. A REST API is also provided to exploit the tool's functionalities."
    },
    {
        "img": "posters/poster30April2022Portrait.pdf",
        "title": "Fallacious Argument Classification In Political Debates",
        "authors": "Pierpaolo Goffredo, Elena Cabrio, Serena Villata, Shohreh Haddadan, Vorakit Vorakitphan",
        "category": "Application",
        "description": "Fallacies play a prominent role in argumentation since antiquity due to their contribution to argumentation in critical thinking education. Their role is even more crucial nowadays as contemporary argumentation technologies face challenging tasks as misleading and manipulative information detection in news articles and political discourse, and counter-narrative generation. Despite some work in this direction, the issue of classifying arguments as being fallacious largely remains a challenging and an unsolved task. Our contribution is twofold: first, we present a novel annotated resource of 31 political debates from the U.S. Presidential Campaigns, where we annotated six main categories of fallacious arguments (i.e., ad hominem, appeal to authority, appeal to emotion, false cause, slogan, slippery slope) leading to 1628 annotated fallacious arguments; second, we tackle this novel task of fallacious argument classification and we define a neural architecture based on transformers outperforming state-of-the-art results and standard baselines. Our results show the important role played by argument components and relations in this task"
    },
    {
        "img": "posters/xiaoou.pdf",
        "title": "Argument and Counter-argument Generation: a Critical Survey",
        "authors": "Wang Xiaoou, Elena Cabrio, Serena Villata",
        "category": "Resource",
        "description": "Argument Generation (AG) is becoming an increasingly active research topic in Natural Language Processing (NLP), and a wide variety of terms has been used to highlight different aspects and methods of AG such as argument construction, argument retrieval, argument synthesis and argument summarization, producing a vast literature. This article aims to draw a comprehensive picture of the literature concerning argument generation and counter-argument generation (CAG). Despite the increasing interest on this topic, no attempt has been made yet to critically review the diverse and rich literature in AG and CAG. By confronting works from the relevant subareas of NLP, we provide a holistic vision that is essential for future works aiming to produce understandable, convincing and ethically sound arguments and counter-arguments."
    },
    {
        "img": "posters/A0_TAL_RADIA_Pinto_Risch.pdf",
        "title": "Logique de l'argumentation subjective : analyse et formalisation appliquées aux infox",
        "authors": "Jean-Jacques Pinto, Vincent Risch",
        "category": "Algorithm",
        "description": "(1) Étude des facteurs qui influencent la diffusion des infox (2) Étude des facteurs de vulnérabilité des individus face aux infox"
    },
    {
        "img": "posters/Ozturk_Poster.pdf",
        "title": "Tailoring Scientific Argument Mining for Scientific Literature Correction",
        "authors": "Yagmur Ozturk, Cyril Labbé, François Portet",
        "category": "Resource",
        "description": "In this study, we examine the potential application of Scientific Argument Mining (SAM) in enhancing scientific literature correction processes. Specifically, we focus on evaluating SAM's effectiveness in assessing the influence of retracted citations on the accuracy of claims and results within the field of nanobiology. Our objectives include creating a novel SAM dataset derived from nanobiology articles, assessing the adaptability of current SAM frameworks to this new dataset, and offering a comprehensive synthesis of the existing SAM guidelines for scientific literature correction practices."
    },
    {
        "img": "posters/GDR-TAL-RADIA-2.pdf",
        "title": "Intertwining NLP and CP-AI-OR Reasoning for Constrained Text Generation",
        "authors": "A. Bonlarron, A. Calabrèse, P. Kornprobst, J.-C. Régin",
        "category": "Prototypical Task",
        "description": "Beam Search fails to generate constrained text when the solutions space is strongly constrained (e.g., length, display). When constraints are defined on the whole text. Our CP-based approach solves it."
    },
    {
        "img": "posters/T-103858 EURECOM POSTER A0 REF1N91RCPPA (1).pdf",
        "title": "Generation of Training Examples for Tabular Natural Language Inference",
        "authors": "Jean-Flavien Bussotti, Paolo Papotti",
        "category": "Prototypical Task",
        "description": "Tabular data is an important source of information in tabular NL inference, (TNLI) such as computational fact-checking tasks. Given tables, existing approaches to generate training data for fact-checking models are either based on expensive human annotations or on methods that produce simple examples. We propose a system, Tenet, for the automatic generation of training examples given only the tables as input."
    },
    {
        "img": "posters/Lexhnology_POSTER.pdf",
        "title": "Rhetorical role prediction in case law: What advances in the use of encoders (BERT) and decoders (GPT)?",
        "authors": "Anas Belfathi, Richard Dufour, Nicolas Hernandez, Christine Jacquin, Laura Monceaux",
        "category": "Resource",
        "description": "Lexhnology ANR Project. Support the research for similar cases, understand sucessful reasoning, make it easier to read the full text, improve the ability to understand legal texts..."
    },
    {
        "img": "posters/nice_poster_final.pdf",
        "title": "Argument Mining with Customized and Feature-Injected Large Language Models",
        "authors": "Umer Mushtaq",
        "category": "Application",
        "description": "Natural Language Processing (NLP) is a field of artificial intelligence of major importance. In this domain, Transformers and Large Language Models (LLMs) represent a significant paradigm shift. By enabling parallel processing and capturing long-range dependencies, LLMs have achieved state-of-the-art results in NLP tasks. Argument Mining (AM) focuses on the automatic detection of structured arguments and their relationships within a textual corpus. Argument Mining has multiple applications, such as the analysis of legal texts or scientific articles.This PhD thesis focuses on Argument Mining (AM) and Large Language Models (LLMs). Our first contribution concerns argument classification. We propose a unified BERT model enriched with additional contextual, structural, and syntactical features provided – in textual form – instead of the usual numerical form. Our second contribution focuses on argument classification and argument relation identification tasks. In this context, we propose BERT–MINUS, a model composed of multiple BERT sub-modules capable of integrating additional text-based features as well as enabling transfer learning between the two tasks.Our third contribution lies at the intersection of argumentative systems and decision theory.Here, we define a framework called 'Bipolar Layered Framework with Support and Weights' (BLFSW), which provides a graph-based modeling for argumentation-based decisions.The extended expressiveness of this formalism allows for a refined evaluation of decision-making processes. "}
]
]
